tutorials/CFD/19UnsteadyNSExplicit_copy/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       367500;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7500;
        startFace       370000;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5000;
        startFace       377500;
    }
)

// ************************************************************************* //
